{"page":"UnParteiAnfragen","page_id":"95347720","share_type":"discussion","created":"2012-02-21T03:42:02-08:00","createdBy":"Alexander_Jobst","title":"WikiTextEditor","description":"Habe den WikiTextEditor gefunden. <br \/>\n<br \/>\nArbeite mich da ein. <br \/>\n<br \/>\nNur im Pad zu schreiben ist teilweise nicht glücklich, da formatierungen und Querverweise nicht schnell genug eingefügt werden können. <br \/>\n<br \/>\nAlexander","replies":[{"user":"fridemar","created":"2012-02-21T13:44:38-08:00","body":"Schnelles Einfuegen von WikiSyntax Format (inklusive Links) geht superschnell mit dem kostenlosen <!-- ws:start:WikiTextUrlRule:1:http:\/\/autohotkey.com --><a class=\"wiki_link_ext\" href=\"http:\/\/autohotkey.com\" rel=\"nofollow\">http:\/\/autohotkey.com<\/a><!-- ws:end:WikiTextUrlRule:1 --> (Windows).<br \/>\nSebastian hat da schon einiges gemacht."},{"user":"Alexander_Jobst","created":"2012-02-21T14:11:38-08:00","body":"das ist in meinen Augen wieder nur ein externer krampf, da es superviel Einarbeitung benötigt.<br \/>\n<br \/>\nWir brauchen in meinen Augen einen einfachen Weg, der diese WorkArounds irgendwie umgeht. <br \/>\n<br \/>\nIch will mich konzeptionell beschäftigen und mich nicht ständig mit technischen \/ softwareFragen herumPlagen."},{"user":"fridemar","created":"2012-02-21T17:17:15-08:00","body":"Meistens brauchen wir im Pad keine besonderen Formatierungen. Da im Pad der ständige Wechsel zwischen Editmode und Viewmode entfällt, ergeben sich insgesamt doch Zeitvorteile.<br \/>\nNicht jede Änderung im Pad muss gleich abgespeichert werden.<br \/>\n<!-- ws:start:WikiTextUrlRule:2:http:\/\/google.com\/search?q=c2+DontModeMe --><a class=\"wiki_link_ext\" href=\"http:\/\/google.com\/search?q=c2+DontModeMe\" rel=\"nofollow\">http:\/\/google.com\/search?q=c2+DontModeMe<\/a><!-- ws:end:WikiTextUrlRule:2 -->"},{"user":"Alexander_Jobst","created":"2012-02-22T03:51:02-08:00","body":"dann macht es jedoch Sinn, die Pads als Arbeitsplattform per IFrame nach oben zu nehmen und die WikiSeite als &quot;Sicherheitskopie&quot; im unteren Bereich anzusiedeln. <br \/>\n<br \/>\nFür außenstehende ist in meinen Augen im Moment kaum erkennbar, daß &quot;da unten im Pad&quot; gearbeitet werden &quot;soll&quot;."},{"user":"fridemar","created":"2012-02-22T15:02:11-08:00","body":"Gegenwärtig arbeiten wir mit einer kostenlosen Variante eines Wikis der WikiFarm WikiSpaces.<br \/>\nDiese kostenlosen Wikis werden finanziert durch Werbeschaltungen im WikiHauptbereich (Werb ung, die wir zum Glück noch nicht haben). Irgendwo steht in den &quot;Terms&quot;, dass wir Werbeschaltungen durch Veränderungen des ScreenSpace nicht behindern dürfen.<br \/>\nDaher kann das Pad und andere SocialTools in voller Breite nur diskret hinten angehängt werden.<br \/>\nWenn wir einen eigenen Server mit einer OpenSource WikiSoftware haben, dann ist dies eine interessante Option, die wir im Auge behalten sollten."}]}